In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Marks.csv")

In [3]:
df

         Name  No.  Marks
0     Nisheet    0     91
1     Dhairya    1     81
2   Priyanshu    2     71
3       Shlok    3     72
4        Meet    4     84
5      Purvam    5     60
6        Amit    6     10
7       Rahul    7     78
8       Dhyan    8     95
9       Rutva    9     75
10       Abhi   10     77
11      Manav   11     90
12       yoyo   12     90
13       uouo   14     60

In [4]:
df.head()

        Name  No.  Marks
0    Nisheet    0     91
1    Dhairya    1     81
2  Priyanshu    2     71
3      Shlok    3     72
4       Meet    4     84

In [5]:
df.shape

(14, 3)

In [6]:
df.tail()

     Name  No.  Marks
9   Rutva    9     75
10   Abhi   10     77
11  Manav   11     90
12   yoyo   12     90
13   uouo   14     60

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    14 non-null     object
 1   No.     14 non-null     int64
 2   Marks   14 non-null     int64
dtypes: int64(2), object(1)
memory usage: 464.0+ bytes